[
  {
    "id": 0,
    "batName": "Atlas BBCOR Baseball Bat: WBL2845010",
    "image": "assets/images/atlas.jpg",
    "manufacturer": "Louisville Slugger",
    "material": "Alloy (With a Composite End Cap)",
    "lengths": [
      "29 inches",
      "30 inches",
      "31 inches",
      "32 inches",
      "32.5 inches",
      "33 inches",
      "33.5 inches",
      "34 inches"
    ],
    "weights": [
      "26 oz.",
      "27 oz.",
      "28 oz.",
      "29 oz.",
      "30 oz.",
      "30.5 oz.",
      "31 oz."
    ],
    "barrel": "2 5/8 Inch",
    "certification": "BBCOR",
    "description": "The Louisville Slugger Atlas BBCOR Baseball Bat is a cutting-edge bat that combines artificial intelligence and kinetic response software to deliver exceptional performance. It features Slugger's EVOKE Alloy barrel with variable wall thickness, creating a large sweet spot and optimizing performance. The bat also incorporates a composite SPD-Gen2 End Cap and a Tuned Mass Damper (TMD) in the handle to enhance swing speeds and eliminate unwanted vibrations. With its updated design and advanced features, this bat provides consistent power and precise barrel control, making it an ideal choice for high school and college ballplayers.",
    "link": "https://www.justbats.com/product/louisville-slugger-atlas-bbcor-baseball-bat--wbl2845010/36748/"
  },
  {
    "id": 1,
    "batName": "CATX BBCOR Baseball Bat: MCBCX",
    "image": "assets/images/catx.jpg",
    "manufacturer": "Marucci",
    "material": "AZR Alloy",
    "lengths": [
      "29 inches",
      "30 inches",
      "31 inches",
      "32 inches",
      "32.5 inches",
      "33 inches",
      "33.5 inches",
      "34 inches"
    ],
    "weights": [
      "26 oz.",
      "27 oz.",
      "28 oz.",
      "29.5 oz.",
      "30 oz.",
      "30.5 oz.",
      "31 oz."
    ],
    "barrel": "2 5/8 Inch",
    "certification": "BBCOR",
    "description": "The CatX baseball bat by Marucci is designed to maintain the brand's dominance in the industry. With a re-shaped AZR Alloy barrel profile, the CatX offers a balanced swing weight, wider sweet spot, and improved forgiveness. It also features a Liquid-Gel Dampening Knob, which uses clear liquid gel to reduce vibrations and sting. The custom-sized handle tapers provide a more ergonomic fit and enhanced bat control. Combined with Marucci's AZR Alloy and Multi-Variable Wall design, the CatX is a high-performing and durable bat that will elevate your game to the next level.",
    "link": "https://www.justbats.com/product/louisville-slugger-atlas-bbcor-baseball-bat--wbl2845010/36748/"
  },
  {
    "id": 2,
    "batName": "Voodoo One BBCOR Baseball Bat: WBD2461010",
    "image": "assets/images/voodoo.jpg",
    "manufacturer": "DeMarini",
    "material": "X14 Alloy",
    "lengths": [
      "29 inches",
      "30 inches",
      "31 inches",
      "32 inches",
      "33 inches",
      "34 inches"
    ],
    "weights": ["26 oz.", "27 oz.", "28 oz.", "29 oz.", "30 oz.", "31 oz."],
    "barrel": "2 5/8 Inch",
    "certification": "BBCOR",
    "description": "The DeMarini Voodoo One BBCOR Baseball Bat: WBD2461010 is a popular choice for both clean-up and lead-off hitters. With its light-swinging design and durable construction, this bat delivers exceptional performance. The X14 alloy barrel and reinforced handle provide increased power and control, allowing players to generate more extra-base hits. The bat's redesigned fortified metal knob enhances durability and leverage during swings. The tapered construction helps reduce hand stings while maximizing hits. Backed by DeMarini's warranty, this bat offers peace of mind and reliable support for customers. Whether you're a rising high school star or a college cleanup hitter, the Voodoo One is designed to fuel your performance on the field.",
    "link": "https://www.justbats.com/product/marucci-catx-bbcor-baseball-bat--mcbcx/35855/"
  }
]
